---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GridlineSpecStatus
source: html/7b494a99-977e-3dd8-023a-4ebfbd600a4a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GridlineSpecStatus Property

"Type Association"

## Syntax (C#)
```csharp
public static ForgeTypeId GridlineSpecStatus { get; }
```